iostpl.org
* ios5新功能
** iCloud
+ 支持键值存储、冲突处理
+ UIDocument/UIManagedDocument/NSFileManager
** LLVM3.0编译器
** ARC
+ 最小支持IOS4
+ 是编译器LLVM特性
** Storyboard
+ 是IOS5特性
** UIKit Customization
+ UIAppearance protocol
** Twitter等社交框架
+ via iOS
+ Twitter.Framework
** 其它
+ Newsstand Kit
+ CIImage/CIFilter: 图片处理
+ CIDetector: 模式识别
+ UIStepper(new control)/UIPageViewController(curl)

* Xcode4
+ 默认编译器: LLVM3.0
+ front end: Clang 更好更快的编译
** UI
+ 快捷键
  - Cmd-Shift-2 :: Organizer
  - F6 :: step over
  - F7 :: step into
  - F8 :: step out
  - Cmd-Opt-J :: 源文件filter
** LLVM3.0
- 编译器前端提供一个即时的解析以及对预定义宏的处理。
- 后端生成二进制代码并且进行优化。
- GCC是一个后端编译器
** Schemes
build产品的一系列指令
*** 分类
- Run ::
- Test ::
+ Profile :: Instruments
+ Analyze :: Clang static analyzer 提示潜在的内存泄露
+ Archive :: 打包成xcarchive(ipa)文件
*** 分享scheme
+ scheme保存在xcuserdata文件夹下
+ 选中sdhared后，scheme会复制到xcshareddata文件夹
** build配置
+ 新建 :: File->New File->Other->Configuration Setting File
+ 共享 :: build config里可以包含另一个build config，采用'#include "share.xcconfig"'
+ xcconfig添加行 :: project->build settings->选择basic和levels,Cmd-C进行复制
+ 采用xcconfig :: project->info->configuration
** Organizer
*** Automatic Device Provisioning
任何带有Push Notification, Game Center, iCloud, IAP都不能采用*作为appid的，不能使用
*** console logs
*** sandbox data
可以往sandbox进行添加删除工作

* OBJC最佳实践
** 命名规范
+ 静态变量以s开头、全局变量以g开头
=static MYThing *sSharedInstance;=
+ Core Foundation中，常量以k开头
=static const NSUInteger kMaxNumberOfRows = 3;=
+ 方法的参数以a/an/the开头
+ instance varibles (ivars) 以m开头 或者 以结尾，避免与apple预定义的产生冲突
+ 类的第一个字母都要大写
** ARC
*** ARC与垃圾回收不同
+ ARC内存回收进行在 *编译期* 而不在运行期，在编译期间注入retain和release，所以要比垃圾回收速度性能要快很多
+ ARC不能处理引用循环，但是垃圾回收可以
#+BEGIN_EXAMPLE
External Object -> Object A <-> Object B
如果External Object到Object A的链接断开，
在Snow Leopard垃圾回收之中，Object A & B都会摧毁，因为它们已经被程序遗弃；
在ARC中，Object A & B不会被销毁，因为它们互相有一个大于零的retain count。
#+END_EXAMPLE
+ ARC中也必须保持对strong关系的追踪，以防引用循环
*** ARC最佳实践
+ delegate应该总是weak
+ 可以进行dealloc操作，例如移除KVO， *不能调用* =[super dealloc]=
+ 定义一个 =copy****= 方法，ARC会 +1 retain count。同样，也会在相应地方加入一个 =release= 。
#+BEGIN_EXAMPLE
可能违背于Cocoa命名规范
例如一个property名为copyRight，ARC看到它的accessor方法以copy开头，所以会将retain count +1
如果getter和调用的代码都用ARC编译的，会稍微不那么效率点，先retain count +1 再 release
可能会碰到的问题：
如果calling code用ARC编译，而copyRight不是，则ARC会注入一个release, 导致程序crash
如果copyRight使用ARC编译，calling code不是，则会少一个release，导致内存泄露
解决方案：
+ 重命名为copyright
+ 在方法声明时候加上NS_RETURNS_RETAINED或NS_RETURNS_NOT_RETAINED
#+END_EXAMPLE
*** ARC规范
+ 不要调用retain、release和autorelease，也不要重写这些方法。
+ 不要在C struct中定义对象指针。如果一定要再C struct中存储对象，需要将该对象强制转换成void*
+ 不要在id和void*之间强制转换，除非使用bridging cast。
+ 不要使用NSAutoreleasePool。@autoreleasepool比NSAutoreleasePool快了超过20倍。
** Properties
+ synthesize能够自动生成ivar
+ 在category中不能synthesize一个property
+ 建议全部使用property并且synthesize每一个property
+ 如下代码
#+BEGIN_SRC C
@interface MyClass : NSObject
@property (readonly, strong) NSString *readonlyString;
@end

@interface MyClass()
@property (readwrite, strong) NSString *readonlyString;
@end
@implementation MyClass
@synthesize readonlyString = readonlyString_
@end
#+END_SRC
=readonlyString= 在class extension中重定义成readwrite，允许你建一个私立的setter。
*** Property Attribute
