iostpl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>iostpl</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="iostpl"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-08 10:55:22 CST"/>
<meta name="author" content="Yifeng Li"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">iostpl</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 ios5新功能</a>
<ul>
<li><a href="#sec-1-1">1.1 iCloud</a></li>
<li><a href="#sec-1-2">1.2 LLVM3.0编译器</a></li>
<li><a href="#sec-1-3">1.3 ARC</a></li>
<li><a href="#sec-1-4">1.4 Storyboard</a></li>
<li><a href="#sec-1-5">1.5 UIKit Customization</a></li>
<li><a href="#sec-1-6">1.6 Twitter等社交框架</a></li>
<li><a href="#sec-1-7">1.7 其它</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Xcode4</a>
<ul>
<li><a href="#sec-2-1">2.1 UI</a></li>
<li><a href="#sec-2-2">2.2 LLVM3.0</a></li>
<li><a href="#sec-2-3">2.3 Schemes</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 分类</a></li>
<li><a href="#sec-2-3-2">2.3.2 分享scheme</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4 build配置</a></li>
<li><a href="#sec-2-5">2.5 Organizer</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1 Automatic Device Provisioning</a></li>
<li><a href="#sec-2-5-2">2.5.2 console logs</a></li>
<li><a href="#sec-2-5-3">2.5.3 sandbox data</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 OBJC最佳实践</a>
<ul>
<li><a href="#sec-3-1">3.1 命名规范</a></li>
<li><a href="#sec-3-2">3.2 ARC</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 ARC与垃圾回收不同</a></li>
<li><a href="#sec-3-2-2">3.2.2 ARC最佳实践</a></li>
<li><a href="#sec-3-2-3">3.2.3 ARC规范</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3 Properties</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1 Property Attribute</a></li>
<li><a href="#sec-3-3-2">3.3.2 property实践</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4 Accessor</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1 使用accessor的原因</a></li>
<li><a href="#sec-3-4-2">3.4.2 不应该使用accessor的地方</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5 Categories And Extensions</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1 Category</a></li>
<li><a href="#sec-3-5-2">3.5.2 享元(flyweight)方法使用category data</a></li>
<li><a href="#sec-3-5-3">3.5.3 Class Extension</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6 正式和非正式协议</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1 非正式协议</a></li>
<li><a href="#sec-3-6-2">3.6.2 正式协议Protocol</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 Cocoa设计模式</a>
<ul>
<li><a href="#sec-4-1">4.1 MVC</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 model</a></li>
<li><a href="#sec-4-1-2">4.1.2 view</a></li>
<li><a href="#sec-4-1-3">4.1.3 controller</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 Delegate &amp; DataSource</a></li>
<li><a href="#sec-4-3">4.3 Command Pattern</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 Target-Action</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> ios5新功能</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> iCloud</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>支持键值存储、冲突处理
</li>
<li>UIDocument/UIManagedDocument/NSFileManager
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> LLVM3.0编译器</h3>
<div class="outline-text-3" id="text-1-2">

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> ARC</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>最小支持IOS4
</li>
<li>是编译器LLVM特性
</li>
</ul>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Storyboard</h3>
<div class="outline-text-3" id="text-1-4">

<ul>
<li>是IOS5特性
</li>
</ul>

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> UIKit Customization</h3>
<div class="outline-text-3" id="text-1-5">

<ul>
<li>UIAppearance protocol
</li>
</ul>

</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Twitter等社交框架</h3>
<div class="outline-text-3" id="text-1-6">

<ul>
<li>via iOS
</li>
<li>Twitter.Framework
</li>
</ul>

</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 其它</h3>
<div class="outline-text-3" id="text-1-7">

<ul>
<li>Newsstand Kit
</li>
<li>CIImage/CIFilter: 图片处理
</li>
<li>CIDetector: 模式识别
</li>
<li>UIStepper(new control)/UIPageViewController(curl)
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Xcode4</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>默认编译器: LLVM3.0
</li>
<li>front end: Clang 更好更快的编译
</li>
</ul>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> UI</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>快捷键
<dl>
<dt>Cmd-Shift-2</dt><dd>Organizer
</dd>
<dt>F6</dt><dd>step over
</dd>
<dt>F7</dt><dd>step into
</dd>
<dt>F8</dt><dd>step out
</dd>
<dt>Cmd-Opt-J</dt><dd>源文件filter
</dd>
</dl>

</li>
</ul>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> LLVM3.0</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>编译器前端提供一个即时的解析以及对预定义宏的处理。
</li>
<li>后端生成二进制代码并且进行优化。
</li>
<li>GCC是一个后端编译器
</li>
</ul>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Schemes</h3>
<div class="outline-text-3" id="text-2-3">

<p>build产品的一系列指令
</p>
</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> 分类</h4>
<div class="outline-text-4" id="text-2-3-1">

<dl>
<dt>Run</dt><dd>
</dd>
<dt>Test</dt><dd>
</dd>
<dt>Profile</dt><dd>Instruments
</dd>
<dt>Analyze</dt><dd>Clang static analyzer 提示潜在的内存泄露
</dd>
<dt>Archive</dt><dd>打包成xcarchive(ipa)文件
</dd>
</dl>

</div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> 分享scheme</h4>
<div class="outline-text-4" id="text-2-3-2">

<ul>
<li>scheme保存在xcuserdata文件夹下
</li>
<li>选中sdhared后，scheme会复制到xcshareddata文件夹
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> build配置</h3>
<div class="outline-text-3" id="text-2-4">

<dl>
<dt>新建</dt><dd>File-&gt;New File-&gt;Other-&gt;Configuration Setting File
</dd>
<dt>共享</dt><dd>build config里可以包含另一个build config，采用'#include "share.xcconfig"'
</dd>
<dt>xcconfig添加行</dt><dd>project-&gt;build settings-&gt;选择basic和levels,Cmd-C进行复制
</dd>
<dt>采用xcconfig</dt><dd>project-&gt;info-&gt;configuration
</dd>
</dl>

</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Organizer</h3>
<div class="outline-text-3" id="text-2-5">


</div>

<div id="outline-container-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> Automatic Device Provisioning</h4>
<div class="outline-text-4" id="text-2-5-1">

<p>任何带有Push Notification, Game Center, iCloud, IAP都不能采用*作为appid的，不能使用
</p></div>

</div>

<div id="outline-container-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> console logs</h4>
<div class="outline-text-4" id="text-2-5-2">

</div>

</div>

<div id="outline-container-2-5-3" class="outline-4">
<h4 id="sec-2-5-3"><span class="section-number-4">2.5.3</span> sandbox data</h4>
<div class="outline-text-4" id="text-2-5-3">

<p>可以往sandbox进行添加删除工作
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> OBJC最佳实践</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 命名规范</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>静态变量以s开头、全局变量以g开头
</li>
</ul>

<p><code>static MYThing *sSharedInstance;</code>
</p><ul>
<li>Core Foundation中，常量以k开头
</li>
</ul>

<p><code>static const NSUInteger kMaxNumberOfRows = 3;</code>
</p><ul>
<li>方法的参数以a/an/the开头
</li>
<li>instance varibles (ivars) 以m开头 或者 以结尾，避免与apple预定义的产生冲突
</li>
<li>类的第一个字母都要大写
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> ARC</h3>
<div class="outline-text-3" id="text-3-2">


</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> ARC与垃圾回收不同</h4>
<div class="outline-text-4" id="text-3-2-1">

<ul>
<li>ARC内存回收进行在 <b>编译期</b> 而不在运行期，在编译期间注入retain和release，所以要比垃圾回收速度性能要快很多
</li>
<li>ARC不能处理引用循环，但是垃圾回收可以
</li>
</ul>




<pre class="example">External Object -&gt; Object A &lt;-&gt; Object B
如果External Object到Object A的链接断开，
在Snow Leopard垃圾回收之中，Object A &amp; B都会摧毁，因为它们已经被程序遗弃；
在ARC中，Object A &amp; B不会被销毁，因为它们互相有一个大于零的retain count。
</pre>

<ul>
<li>ARC中也必须保持对strong关系的追踪，以防引用循环
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> ARC最佳实践</h4>
<div class="outline-text-4" id="text-3-2-2">

<ul>
<li>delegate应该总是weak
</li>
<li>可以进行dealloc操作，例如移除KVO， <b>不能调用</b> <code>[super dealloc]</code>
</li>
<li>定义一个 <code>copy****</code> 方法，ARC会 +1 retain count。同样，也会在相应地方加入一个 <code>release</code> 。
</li>
</ul>




<pre class="example">可能违背于Cocoa命名规范
例如一个property名为copyRight，ARC看到它的accessor方法以copy开头，所以会将retain count +1
如果getter和调用的代码都用ARC编译的，会稍微不那么效率点，先retain count +1 再 release
可能会碰到的问题：
如果calling code用ARC编译，而copyRight不是，则ARC会注入一个release, 导致程序crash
如果copyRight使用ARC编译，calling code不是，则会少一个release，导致内存泄露
解决方案：
+ 重命名为copyright
+ 在方法声明时候加上NS_RETURNS_RETAINED或NS_RETURNS_NOT_RETAINED
</pre>

</div>

</div>

<div id="outline-container-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> ARC规范</h4>
<div class="outline-text-4" id="text-3-2-3">

<ul>
<li>不要调用retain、release和autorelease，也不要重写这些方法。
</li>
<li>不要在C struct中定义对象指针。如果一定要再C struct中存储对象，需要将该对象强制转换成void*
</li>
<li>不要在id和void*之间强制转换，除非使用bridging cast。
</li>
<li>不要使用NSAutoreleasePool。@autoreleasepool比NSAutoreleasePool快了超过20倍。
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Properties</h3>
<div class="outline-text-3" id="text-3-3">

<ul>
<li>synthesize能够自动生成ivar
</li>
<li>在category中不能synthesize一个property
</li>
<li>建议全部使用property并且synthesize每一个property
</li>
<li>如下代码
</li>
</ul>




<pre class="src src-C">@interface MyClass : NSObject
@property (readonly, strong) <span style="color: #a57705;">NSString</span> *<span style="color: #a57705;">readonlyString</span>;
@end

@interface MyClass()
@property (readwrite, strong) <span style="color: #a57705;">NSString</span> *<span style="color: #a57705;">readonlyString</span>;
@end
@implementation MyClass
@synthesize readonlyString = readonlyString_
@end
</pre>

<p>
<code>readonlyString</code> 在class extension中重定义成readwrite，允许你建一个私立的setter。
</p>
</div>

<div id="outline-container-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Property Attribute</h4>
<div class="outline-text-4" id="text-3-3-1">

<ul>
