iostpl.org
**** Atomic -- nonatomic.
+ 没有 =atomic= 属性, nonatomic非原子性，默认即为atomic。
+ 如果将property设为 =atomic=，它的accessor是线程安全的，但是array的 =objectAtIndex= 并不是线程安全的，需要写如下code
#+BEGIN_SRC C
[_propertyLock lock];
id result = [[value retain] autorelease];
[_propertyLock unlock];
return result;
// retain/autorelase防止其他线程的caller在这个accessor运行中release了这个对象
#+END_SRC
+ ARC对 =atomic= 有着很好的性能提高
**** Writability
+ readwrite
+ readonly
**** Setter语义
+ copy ： 对于immutable类应该使用copy。由于mutable类是immutable类的子类，这样可以防止例如将NSString赋值给NSMutableString, 从而造成immutable类改变的情况出现。
+ weak
+ strong
*** property实践
+ getter不应该有任何外部的副作用，可以有内部的副作用如caching。
+ 如下能够使private ivar脱离public header。
#+BEGIN_SRC C
@implementation Something {
    NSString *name;
    __weak NSString *weakName;     // default strong; weak ivar
}
#+END_SRC
** Accessor
*** 使用accessor的原因
+ KVO :: property能够被observed。如果不使用accessor，每次都需要自己调用 =willChangeValueForKey:= 和 =didChangeValueForKey:= ，而使用accessor会自动调用这些观察方法。
+ Side effect :: 当前类或者其子类可以在setter中引入side effect。可以post notification或者注册为NSUndoManager或者增加caching。
+ Locking :: 引入对property加locking，支持多线程。如果直接使用ivar access，将不会采用locking，导致crash。
+ 一致性 :: 与全局property的accessor方法保持一致
*** 不应该使用accessor的地方
+ accessor :: 直接使用ivar
+ dealloc :: dealloc时对象处于一个不稳定的状态，使用accessor可能在对象正在销毁的时候接收到notification
+ initialization :: 不能调用post notification 或有其他相同作用的功能。
** Categories And Extensions
*** Category
**** 特性
+ 在 *运行期* 增加方法，是动态加载的
+ 能够分散一个大的class到各个小块
+ 一个过大的implementation文件通常是指你需要重构这个类，而不是把它分成各个category。如果你的类有足够正确的大小，你可以通过分成各个categories变得更加方便。
+ category不能定义ivar，也不能synthesize property
+ 技术上来讲在category中override一个方法是可行的，但是并不建议。如果两个category实现了同样的方法，就无法确定哪一个先使用。
**** +load
+ 当category第一次动态加载时，会执行+load，可以执行一些category-specific setup，例如初始化static变量。
+ category不能使用+initialize，因为可能类已经实现了这个方法。如果很多category实现了+initialize，将无法确定哪一个将会执行。
+ 无法保证+load执行的顺序
+ 不能自己手动调用+load
+ +load 经常在category运行期动态加载的时候执行，一般优先于main函数
+ 类也可以由+load函数，运行期加载，一般不常用。
+ +load不必调用也不能调用 =[super load]= 。
**** Category Data Using Associative References
+ Associative Reference允许给实例对象绑定key-value data。
#+BEGIN_SRC C
#import <objc/runtime.h>
@interface Person (EmailAddress)
@property (readwrite, copy) NSString *emailAddress;
@end

@implementation Person (EmailAddress)
static char emailAddressKey;
- (NSString*)emailAddress {
    return objc_getAssociatedObject(self, &emailAddressKey);
}
- (void)setEmailAddress:(NSString*)emailAddress {
    objc_setAssociatedObject(self, &emailAddressKey, emailAddress, OBJC_ASSOCIATION_COPY);
}
#+END_SRC
+ associative reference是绑定于key的内存地址
+ key必须指定为 =static char=
+ associative reference也是一个很好的方法，给一些view panel绑定对象
#+BEGIN_SRC C
static char kRepresentedObject;

    id interestingObject = ...;
    UIAlertView *alert = [[UIAlertView alloc] ...];
    objc_setAssociatedObject(alert, &kRepresentedObject, interestingObject, OBJC_ASSOCIATION_RETAIN_NONATOMIC);
    [alert show]

// alert view delegate
- (void)alertView:(UIAlertView*)alertView clickedButtonAtIndex:(NSInteger)index {
    UIButton *sender = objc_getAssociatedObject(alertView, &kRepresentedObject);
    sender....
}
#+END_SRC
+ associative reference的限制在于它无法与 =encodeWithCoder:= 结合
*** 享元(flyweight)方法使用category data
+ 相比于在object中存入data，使用享元将在object外部存储数据并且保有一些key去找到它们
+ 下面的person类有一个field:identifier，作为这个key
#+BEGIN_SRC C
@interface Person : NSObject
@property (readonly, copy) NSString *identifier;
@property (readwrite, copy) NSString *name;
- (Person *)initwithIdentifier:(NSString*)anIdentifier;
@end
@implementation Person
@synthesize identifier = identifer_;
@synthesize name = name_;
- (Person*)initWithIdentifier:(NSString*) {
    if ((self = [super init])) {
        identifier_ = [anIdentifier copy];
    }
    return self;
}
@end

// create a emailAddress data
@interface Person(EmailAddress)
@property (readwrite, copy) NSString *emailAddress;
@end
@implementation Person(EmailAddress)
static NSMutableDictionary *sEmailAddressForIdentifier = nil;
+ (void)load {
    sEmailAddressForIdentifier = [[NSMutableDictionary alloc] init];
}
- (NSString*)emailAddress {
    return [sEmailAddressForIdentifier objectForKey:[self identifier]];
}
- (void)setEmailAddress:(NSString*)anAddress {
    [sEmailAddressForIdentifier setObject:[anAddress copy] forKey:[self identifier]];
}
@end
#+END_SRC
+ 享元的方法无法释放内存，除非你能跟踪到Person类被摧毁的时候。
*** Class Extension
+ category的名字是空的，即为class extension
+ 在.m中定义私有方法
+ 会在 *编译期* 而不是运行期加载。
** 正式和非正式协议
*** 非正式协议
+ NSObject上的一个category，即为非正式协议
+ Category会告诉编译器存在这么一个方法，但并不要求这个方法一定会被实现
*** 正式协议Protocol
+ protocol可以像class一样继承
+ NSObject分离为一个class和一个protocol。主要是为了支持NSProxy。protocol继承NSObject是继承它的protocol，而不是class
+ 对于delegate protocol，代理的对象经常位于第一个参数位置，这样允许一个代理管理多个代理对象。
+ 如果没有别的参数，class name放到最后(e.g. =numberOfSectionsInTableView:)= )
+ 如果有别的参数，class name出现在第一个位置(e.g. =tableView:numberOfRowsInSection:= )
+ 能够同时指定class和protocol
#+BEGIN_SRC C
@property (nonatomic, weak) MyClass*<MyDelegate, UITableViewDelegate> delegate;
#+END_SRC

* Cocoa设计模式
** MVC
