iostpl.html
<li id="sec-3-3-1-1">Atomic &ndash; nonatomic.<br/>
<ul>
<li>没有 <code>atomic</code> 属性, nonatomic非原子性，默认即为atomic。
</li>
<li>如果将property设为 <code>atomic=，它的accessor是线程安全的，但是array的 =objectAtIndex</code> 并不是线程安全的，需要写如下code
</li>
</ul>




<pre class="src src-C">[_propertyLock lock];
<span style="color: #a57705;">id</span> <span style="color: #a57705;">result</span> = [[value retain] autorelease];
[_propertyLock unlock];
<span style="color: #728a05;">return</span> result;
<span style="color: #81908f; font-style: italic;">// </span><span style="color: #708183; font-style: italic;">retain/autorelase&#38450;&#27490;&#20854;&#20182;&#32447;&#31243;&#30340;caller&#22312;&#36825;&#20010;accessor&#36816;&#34892;&#20013;release&#20102;&#36825;&#20010;&#23545;&#35937;</span>
</pre>

<ul>
<li>ARC对 <code>atomic</code> 有着很好的性能提高
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-3-3-1-2">Writability<br/>
<ul>
<li>readwrite
</li>
<li>readonly
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-3-3-1-3">Setter语义<br/>
<ul>
<li>copy ： 对于immutable类应该使用copy。由于mutable类是immutable类的子类，这样可以防止例如将NSString赋值给NSMutableString, 从而造成immutable类改变的情况出现。
</li>
<li>weak
</li>
<li>strong
</li>
</ul>

</li>
</ul>
</div>

</div>

<div id="outline-container-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> property实践</h4>
<div class="outline-text-4" id="text-3-3-2">

<ul>
<li>getter不应该有任何外部的副作用，可以有内部的副作用如caching。
</li>
<li>如下能够使private ivar脱离public header。
</li>
</ul>




<pre class="src src-C">@implementation Something {
    <span style="color: #a57705;">NSString</span> *<span style="color: #a57705;">name</span>;
    __weak <span style="color: #a57705;">NSString</span> *<span style="color: #a57705;">weakName</span>;     <span style="color: #81908f; font-style: italic;">// </span><span style="color: #708183; font-style: italic;">default strong; weak ivar</span>
}
</pre>

</div>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Accessor</h3>
<div class="outline-text-3" id="text-3-4">


</div>

<div id="outline-container-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> 使用accessor的原因</h4>
<div class="outline-text-4" id="text-3-4-1">

<dl>
<dt>KVO</dt><dd>property能够被observed。如果不使用accessor，每次都需要自己调用 <code>willChangeValueForKey:</code> 和 <code>didChangeValueForKey:</code> ，而使用accessor会自动调用这些观察方法。
</dd>
<dt>Side effect</dt><dd>当前类或者其子类可以在setter中引入side effect。可以post notification或者注册为NSUndoManager或者增加caching。
</dd>
<dt>Locking</dt><dd>引入对property加locking，支持多线程。如果直接使用ivar access，将不会采用locking，导致crash。
</dd>
<dt>一致性</dt><dd>与全局property的accessor方法保持一致
</dd>
</dl>

</div>

</div>

<div id="outline-container-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> 不应该使用accessor的地方</h4>
<div class="outline-text-4" id="text-3-4-2">

<dl>
<dt>accessor</dt><dd>直接使用ivar
</dd>
<dt>dealloc</dt><dd>dealloc时对象处于一个不稳定的状态，使用accessor可能在对象正在销毁的时候接收到notification
</dd>
<dt>initialization</dt><dd>不能调用post notification 或有其他相同作用的功能。
</dd>
</dl>

</div>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Categories And Extensions</h3>
<div class="outline-text-3" id="text-3-5">


</div>

<div id="outline-container-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Category</h4>
<div class="outline-text-4" id="text-3-5-1">

<ul>
<li id="sec-3-5-1-1">特性<br/>
<ul>
<li>在 <b>运行期</b> 增加方法，是动态加载的
</li>
<li>能够分散一个大的class到各个小块
</li>
<li>一个过大的implementation文件通常是指你需要重构这个类，而不是把它分成各个category。如果你的类有足够正确的大小，你可以通过分成各个categories变得更加方便。
</li>
<li>category不能定义ivar，也不能synthesize property
</li>
<li>技术上来讲在category中override一个方法是可行的，但是并不建议。如果两个category实现了同样的方法，就无法确定哪一个先使用。
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-3-5-1-2">+load<br/>
<ul>
<li>当category第一次动态加载时，会执行+load，可以执行一些category-specific setup，例如初始化static变量。
</li>
<li>category不能使用+initialize，因为可能类已经实现了这个方法。如果很多category实现了+initialize，将无法确定哪一个将会执行。
</li>
<li>无法保证+load执行的顺序
</li>
<li>不能自己手动调用+load
</li>
<li>+load 经常在category运行期动态加载的时候执行，一般优先于main函数
</li>
<li>类也可以由+load函数，运行期加载，一般不常用。
</li>
<li>+load不必调用也不能调用 <code>[super load]</code> 。
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-3-5-1-3">Category Data Using Associative References<br/>
<ul>
<li>Associative Reference允许给实例对象绑定key-value data。
</li>
</ul>




<pre class="src src-C"><span style="color: #c61b6e;">#import</span> &lt;objc/runtime.h&gt;
@interface Person (EmailAddress)
@property (readwrite, copy) <span style="color: #a57705;">NSString</span> *<span style="color: #a57705;">emailAddress</span>;
@end

@implementation Person (EmailAddress)
<span style="color: #728a05;">static</span> <span style="color: #a57705;">char</span> <span style="color: #a57705;">emailAddressKey</span>;
- (<span style="color: #a57705;">NSString</span>*)emailAddress {
    <span style="color: #728a05;">return</span> objc_getAssociatedObject(self, &amp;emailAddressKey);
}
- (<span style="color: #a57705;">void</span>)setEmailAddress:(<span style="color: #a57705;">NSString</span>*)emailAddress {
    objc_setAssociatedObject(self, &amp;emailAddressKey, emailAddress, OBJC_ASSOCIATION_COPY);
}
</pre>

<ul>
<li>associative reference是绑定于key的内存地址
</li>
<li>key必须指定为 <code>static char</code>
</li>
<li>associative reference也是一个很好的方法，给一些view panel绑定对象
</li>
</ul>




<pre class="src src-C"><span style="color: #728a05;">static</span> <span style="color: #a57705;">char</span> <span style="color: #a57705;">kRepresentedObject</span>;

    <span style="color: #a57705;">id</span> <span style="color: #a57705;">interestingObject</span> = ...;
    <span style="color: #a57705;">UIAlertView</span> *<span style="color: #a57705;">alert</span> = [[UIAlertView alloc] ...];
    objc_setAssociatedObject(alert, &amp;kRepresentedObject, interestingObject, OBJC_ASSOCIATION_RETAIN_NONATOMIC);
    [alert show]

<span style="color: #81908f; font-style: italic;">// </span><span style="color: #708183; font-style: italic;">alert view delegate</span>
- (<span style="color: #a57705;">void</span>)alertView:(<span style="color: #a57705;">UIAlertView</span>*)<span style="color: #a57705;">alertView</span> <span style="color: #2075c7;">clickedButtonAtIndex</span>:(<span style="color: #a57705;">NSInteger</span>)index {
    <span style="color: #a57705;">UIButton</span> *<span style="color: #a57705;">sender</span> = objc_getAssociatedObject(alertView, &amp;kRepresentedObject);
    sender....
}
</pre>

<ul>
<li>associative reference的限制在于它无法与 <code>encodeWithCoder:</code> 结合
</li>
</ul>

</li>
</ul>
</div>

</div>

<div id="outline-container-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> 享元(flyweight)方法使用category data</h4>
<div class="outline-text-4" id="text-3-5-2">

<ul>
<li>相比于在object中存入data，使用享元将在object外部存储数据并且保有一些key去找到它们
</li>
<li>下面的person类有一个field:identifier，作为这个key
</li>
</ul>




<pre class="src src-C">@interface Person : NSObject
@property (readonly, copy) <span style="color: #a57705;">NSString</span> *<span style="color: #a57705;">identifier</span>;
@property (readwrite, copy) <span style="color: #a57705;">NSString</span> *<span style="color: #a57705;">name</span>;
- (<span style="color: #a57705;">Person</span> *)initwithIdentifier:(<span style="color: #a57705;">NSString</span>*)anIdentifier;
@end
@implementation Person
@synthesize identifier = identifer_;
@synthesize name = name_;
- (<span style="color: #a57705;">Person</span>*)initWithIdentifier:(<span style="color: #a57705;">NSString</span>*) {
    <span style="color: #728a05;">if</span> ((self = [super init])) {
        identifier_ = [anIdentifier copy];
    }
    <span style="color: #728a05;">return</span> self;
}
@end

<span style="color: #81908f; font-style: italic;">// </span><span style="color: #708183; font-style: italic;">create a emailAddress data</span>
@interface Person(EmailAddress)
@property (readwrite, copy) <span style="color: #a57705;">NSString</span> *<span style="color: #a57705;">emailAddress</span>;
@end
@implementation Person(EmailAddress)
<span style="color: #728a05;">static</span> <span style="color: #a57705;">NSMutableDictionary</span> *<span style="color: #a57705;">sEmailAddressForIdentifier</span> = nil;
+ (<span style="color: #a57705;">void</span>)load {
    sEmailAddressForIdentifier = [[NSMutableDictionary alloc] init];
}
- (<span style="color: #a57705;">NSString</span>*)emailAddress {
    <span style="color: #728a05;">return</span> [sEmailAddressForIdentifier objectForKey:[self identifier]];
}
- (<span style="color: #a57705;">void</span>)setEmailAddress:(<span style="color: #a57705;">NSString</span>*)anAddress {
    [sEmailAddressForIdentifier setObject:[anAddress copy] forKey:[self identifier]];
}
@end
</pre>

<ul>
<li>享元的方法无法释放内存，除非你能跟踪到Person类被摧毁的时候。
</li>
</ul>

</div>

</div>

<div id="outline-container-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> Class Extension</h4>
<div class="outline-text-4" id="text-3-5-3">

<ul>
<li>category的名字是空的，即为class extension
</li>
<li>在.m中定义私有方法
</li>
<li>会在 <b>编译期</b> 而不是运行期加载。
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 正式和非正式协议</h3>
<div class="outline-text-3" id="text-3-6">


</div>

<div id="outline-container-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> 非正式协议</h4>
<div class="outline-text-4" id="text-3-6-1">

<ul>
<li>NSObject上的一个category，即为非正式协议
</li>
<li>Category会告诉编译器存在这么一个方法，但并不要求这个方法一定会被实现
</li>
</ul>

</div>

</div>

<div id="outline-container-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> 正式协议Protocol</h4>
<div class="outline-text-4" id="text-3-6-2">

<ul>
<li>protocol可以像class一样继承
</li>
<li>NSObject分离为一个class和一个protocol。主要是为了支持NSProxy。protocol继承NSObject是继承它的protocol，而不是class
</li>
<li>对于delegate protocol，代理的对象经常位于第一个参数位置，这样允许一个代理管理多个代理对象。
</li>
<li>如果没有别的参数，class name放到最后(e.g. <code>numberOfSectionsInTableView:)</code> )
</li>
<li>如果有别的参数，class name出现在第一个位置(e.g. <code>tableView:numberOfRowsInSection:</code> )
</li>
<li>能够同时指定class和protocol
</li>
</ul>




<pre class="src src-C">@property (nonatomic, weak) MyClass*&lt;MyDelegate, UITableViewDelegate&gt; delegate;
</pre>


</div>
</div>
</div>

</div>
