iostpl.org
*** model
+ model可以是mutable也可以是immutable的
+ 使用immutable对象做model有很多好处
  - 能够通过调用retain来实现copy
  - 即使不用锁也是线程安全的
  - 保证了对象经常处于一个稳定的状态
*** view
+ 不能有直接带有controller reference
+ 不能带有除了superview和subview的其他 view reference
+ 需要对重用性和简易型(ease-of-use)进行一个平衡
+ 负责接收用户事件，但不处理，交给view的delegate--controller处理
*** controller
+ coordinate between view and model
+ 经常以Manager结尾，并且一般为singleton
+ 应该避免直接引用到别的controller
+ 一个经常犯的错误就是允许许多对象直接引用app delegate
+ 最好的access全局变量的方法是使用singleton
#+BEGIN_SRC C
// Do not do this
MyAppDelegate *appDelegate = (MyAppDelegate*)[[UIApplication sharedApplication] delegate];
Something *something = [appDelegate something];
// Do not do this
#+END_SRC
** Delegate & DataSource
+ delegate负责appearance&behavior，datasource负责显示的data
+ delegate一般设为weak，当然也有特例。
#+BEGIN_EXAMPLE
NSURLConnection retain its delegate, 仅在这个connection正在loading的时候
在loading完成之后，NSURLConnection release delegate，防止retain loop
#+END_EXAMPLE
+ delegate方法同时也是notification的接收方法，是很普遍的。
#+BEGIN_EXAMPLE
UIApplication 调用它的delegate方法 applicationWilTerminate:
它也会post一个notification UIApplicationWillTerminateNotification
#+END_EXAMPLE
+ delegate是一种strategy pattern
** Command Pattern
+ 把message请求封装成一个对象。
+ Cocoa的cammand pattern是target-action和NSInvocation。
*** Target-Action
+ 适用于UIControl。 =addTarget:action:forControlEvents:=
+ target:发送消息到这个object
+ UIControl的action selector签名必须为:
  - =- (void)action;=
  - =- (void)action:(id)sender;=
  - =- (void)action:(id)sender forEvent:(UIEvent*)event;=
+ UIControl能够如下调用这个action:
  =[target performSelector:action withObject:self withObject:event];=
+ target-action和delegate相似，区别在于target-action的selector是可以配置的，而delegate的selector是被协议定义好的。
+ 编译器无法决定这个target是否实现了一个给定的action，但能够通过打开编译器属性来产生warning(Undeclared Selector warning)。编译属性为GCC_WARN_UNDECLARED_SELECTOR, -Wundeclared-selector。
+ 如果只发送一个action给target对象，则采用target-action；如果发送多个action，则采用delegate。
*** 使用签名以及Invocations

