iostpl.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Cocoa设计模式</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> MVC</h3>
<div class="outline-text-3" id="text-4-1">


</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> model</h4>
<div class="outline-text-4" id="text-4-1-1">

<ul>
<li>model可以是mutable也可以是immutable的
</li>
<li>使用immutable对象做model有很多好处
<ul>
<li>能够通过调用retain来实现copy
</li>
<li>即使不用锁也是线程安全的
</li>
<li>保证了对象经常处于一个稳定的状态
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> view</h4>
<div class="outline-text-4" id="text-4-1-2">

<ul>
<li>不能有直接带有controller reference
</li>
<li>不能带有除了superview和subview的其他 view reference
</li>
<li>需要对重用性和简易型(ease-of-use)进行一个平衡
</li>
<li>负责接收用户事件，但不处理，交给view的delegate&ndash;controller处理
</li>
</ul>

</div>

</div>

<div id="outline-container-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> controller</h4>
<div class="outline-text-4" id="text-4-1-3">

<ul>
<li>coordinate between view and model
</li>
<li>经常以Manager结尾，并且一般为singleton
</li>
<li>应该避免直接引用到别的controller
</li>
<li>一个经常犯的错误就是允许许多对象直接引用app delegate
</li>
<li>最好的access全局变量的方法是使用singleton
</li>
</ul>




<pre class="src src-C"><span style="color: #81908f; font-style: italic;">// </span><span style="color: #708183; font-style: italic;">Do not do this</span>
<span style="color: #a57705;">MyAppDelegate</span> *<span style="color: #a57705;">appDelegate</span> = (<span style="color: #a57705;">MyAppDelegate</span>*)[[UIApplication sharedApplication] delegate];
<span style="color: #a57705;">Something</span> *<span style="color: #a57705;">something</span> = [appDelegate something];
<span style="color: #81908f; font-style: italic;">// </span><span style="color: #708183; font-style: italic;">Do not do this</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Delegate &amp; DataSource</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>delegate负责appearance&amp;behavior，datasource负责显示的data
</li>
<li>delegate一般设为weak，当然也有特例。
</li>
</ul>




<pre class="example">NSURLConnection retain its delegate, 仅在这个connection正在loading的时候
在loading完成之后，NSURLConnection release delegate，防止retain loop
</pre>

<ul>
<li>delegate方法同时也是notification的接收方法，是很普遍的。
</li>
</ul>




<pre class="example">UIApplication 调用它的delegate方法 applicationWilTerminate:
它也会post一个notification UIApplicationWillTerminateNotification
</pre>

<ul>
<li>delegate是一种strategy pattern
</li>
</ul>

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Command Pattern</h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li>把message请求封装成一个对象。
</li>
<li>Cocoa的cammand pattern是target-action和NSInvocation。
</li>
</ul>


</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Target-Action</h4>
<div class="outline-text-4" id="text-4-3-1">

<ul>
<li>适用于UIControl。 <code>addTarget:action:forControlEvents:</code>
</li>
<li>target:发送消息到这个object
</li>
<li>UIControl的action selector签名必须为:
<ul>
<li><code>- (void)action;</code>
</li>
<li><code>- (void)action:(id)sender;</code>
</li>
<li><code>- (void)action:(id)sender forEvent:(UIEvent*)event;</code>
</li>
</ul>

</li>
<li>UIControl能够如下调用这个action:
  <code>[target performSelector:action withObject:self withObject:event];</code>
</li>
<li>target-action和delegate相似，区别在于target-action的selector是可以配置的，而delegate的selector是被协议定义好的。
</li>
<li>编译器无法决定这个target是否实现了一个给定的action，但能够通过打开编译器属性来产生warning(Undeclared Selector warning)。编译属性为GCC<sub>WARN</sub><sub>UNDECLARED</sub><sub>SELECTOR</sub>, -Wundeclared-selector。
</li>
<li>如果只发送一个action给target对象，则采用target-action；如果发送多个action，则采用delegate。
</li>
</ul>


</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-06-08 10:55:22 CST</p>
<p class="author">Author: Yifeng Li</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
